Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ2064DAL176.atdf
      <value-group caption="Interrupt Control bits" name="IC3CON__ICI">
         <value caption="Interrupt on every fourth capture event" name="" value="0x3"/>
         <value caption="Interrupt on every third capture event" name="" value="0x2"/>
         <value caption="Interrupt on every second capture event" name="" value="0x1"/>
         <value caption="Interrupt on every capture event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Select bit" name="IC3CON__ICTMR">
         <value caption="Timery is the counter source for capture" name="" value="0x0" />
         <value caption="Timerx is the counter source for capture" name="" value="0x1" />
      </value-group>
      <value-group caption="32-bit Capture Select bit" name="IC3CON__C32">
         <value caption="32-bit timer resource capture" name="" value="0x1" />
         <value caption="16-bit timer resource capture" name="" value="0x0" />
      </value-group>
      <value-group caption="First Capture Edge Select bit" name="IC3CON__FEDGE">
         <value caption="Capture rising edge first" name="" value="0x1" />
         <value caption="Capture falling edge first" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="IC3CON__SIDL">
         <value caption="Halt in CPU Idle mode" name="" value="0x1" />
         <value caption="Continue to operate in CPU Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Module Enable bit" name="IC3CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Disable and reset module" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Mode Select bits" name="IC4CON__ICM">
         <value caption="Interrupt-Only mode (only supported while in Sleep mode or Idle mode)" name="" value="0x7" />
         <value caption="Simple Capture Event mode every edge" name="" value="0x6" />
         <value caption="Prescaled Capture Event mode every sixteenth rising edge" name="" value="0x5" />
         <value caption="Prescaled Capture Event mode every fourth rising edge" name="" value="0x4" />
         <value caption="Simple Capture Event mode every rising edge" name="" value="0x3" />
         <value caption="Simple Capture Event mode every falling edge" name="" value="0x2" />
         <value caption="Edge Detect mode every edge (rising and falling)" name="" value="0x1" />
         <value caption="Input Capture module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Buffer Not Empty Status bit" name="IC4CON__ICBNE">
         <value caption="Input capture buffer is not empty; at least one more capture value can be read" name="" value="0x1" />
         <value caption="Input capture buffer is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Overflow Status Flag bit" name="IC4CON__ICOV">
         <value caption="Input capture overflow is occurred" name="" value="0x1" />
         <value caption="No input capture overflow is occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Control bits" name="IC4CON__ICI">
         <value caption="Interrupt on every fourth capture event" name="" value="0x3"/>
         <value caption="Interrupt on every third capture event" name="" value="0x2"/>
         <value caption="Interrupt on every second capture event" name="" value="0x1"/>
         <value caption="Interrupt on every capture event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Select bit" name="IC4CON__ICTMR">
         <value caption="Timery is the counter source for capture" name="" value="0x0" />
         <value caption="Timerx is the counter source for capture" name="" value="0x1" />
      </value-group>
      <value-group caption="32-bit Capture Select bit" name="IC4CON__C32">
         <value caption="32-bit timer resource capture" name="" value="0x1" />
         <value caption="16-bit timer resource capture" name="" value="0x0" />
      </value-group>
      <value-group caption="First Capture Edge Select bit" name="IC4CON__FEDGE">
         <value caption="Capture rising edge first" name="" value="0x1" />
         <value caption="Capture falling edge first" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="IC4CON__SIDL">
         <value caption="Halt in CPU Idle mode" name="" value="0x1" />
         <value caption="Continue to operate in CPU Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Module Enable bit" name="IC4CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Disable and reset module" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Mode Select bits" name="IC5CON__ICM">
         <value caption="Interrupt-Only mode (only supported while in Sleep mode or Idle mode)" name="" value="0x7" />
         <value caption="Simple Capture Event mode every edge" name="" value="0x6" />
         <value caption="Prescaled Capture Event mode every sixteenth rising edge" name="" value="0x5" />
         <value caption="Prescaled Capture Event mode every fourth rising edge" name="" value="0x4" />
         <value caption="Simple Capture Event mode every rising edge" name="" value="0x3" />
         <value caption="Simple Capture Event mode every falling edge" name="" value="0x2" />
         <value caption="Edge Detect mode every edge (rising and falling)" name="" value="0x1" />
         <value caption="Input Capture module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Buffer Not Empty Status bit" name="IC5CON__ICBNE">
         <value caption="Input capture buffer is not empty; at least one more capture value can be read" name="" value="0x1" />
         <value caption="Input capture buffer is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Overflow Status Flag bit" name="IC5CON__ICOV">
         <value caption="Input capture overflow is occurred" name="" value="0x1" />
         <value caption="No input capture overflow is occurred" name="" value="0x0" />
      </value-group>      <value-group caption="Interrupt Control bits" name="IC5CON__ICI">
         <value caption="Interrupt on every fourth capture event" name="" value="0x3"/>
         <value caption="Interrupt on every third capture event" name="" value="0x2"/>
         <value caption="Interrupt on every second capture event" name="" value="0x1"/>
         <value caption="Interrupt on every capture event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Select bit" name="IC5CON__ICTMR">
         <value caption="Timery is the counter source for capture" name="" value="0x0" />
         <value caption="Timerx is the counter source for capture" name="" value="0x1" />
      </value-group>
      <value-group caption="32-bit Capture Select bit" name="IC5CON__C32">
         <value caption="32-bit timer resource capture" name="" value="0x1" />
         <value caption="16-bit timer resource capture" name="" value="0x0" />
      </value-group>
      <value-group caption="First Capture Edge Select bit" name="IC5CON__FEDGE">
         <value caption="Capture rising edge first" name="" value="0x1" />
         <value caption="Capture falling edge first" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="IC5CON__SIDL">
         <value caption="Halt in CPU Idle mode" name="" value="0x1" />
         <value caption="Continue to operate in CPU Idle mode" name="" value="0x0" />
      </value-group>
