Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ2064DAL176.atdf
      <value-group caption="Group 3 Write Permissions bits" name="SBT16WR3__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT16WR4__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT16WR4__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT16WR4__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT16WR4__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00187" name="SDHC" version="1">
      <register-group name="SDHC">
         <register caption="SDHC Block Control Register" name="SDHCBLKCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Transfer Block Size bits" mask="0x000003FF" name="BSIZE" values="SDHCBLKCON__BSIZE" />
            <bitfield caption="Blocks Count for Current Transfer bits" mask="0xFFFF0000" name="BCOUNT" values="SDHCBLKCON__BCOUNT" />
         </register>
         <register caption="SDHC Argument Register" name="SDHCARG" offset="0x4" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ARG" />
         </register>
         <register caption="SDHC Mode Register" name="SDHCMODE" offset="0x8" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="SDHCMODE__DMAEN" />
            <bitfield caption="Block Count Enable Bit" mask="0x00000002" name="BCEN" values="SDHCMODE__BCEN" />
            <bitfield caption="Auto CMD12 Enable bits" mask="0x0000000C" name="ACEN" values="SDHCMODE__ACEN" />
            <bitfield caption="Data Transfer Direction Select bit" mask="0x00000010" name="DTXDSEL" values="SDHCMODE__DTXDSEL" />
            <bitfield caption="Multiple/Single Block Select bit" mask="0x00000020" name="BSEL" values="SDHCMODE__BSEL" />
            <bitfield caption="Response Type Select bits" mask="0x00030000" name="RESPTYPE" values="SDHCMODE__RESPTYPE" />
            <bitfield caption="Command CRC Check Enable bit" mask="0x00080000" name="CCRCCEN" values="SDHCMODE__CCRCCEN" />
            <bitfield caption="Command Index Check Enable bit" mask="0x00100000" name="CIDXCEN" values="SDHCMODE__CIDXCEN" />
            <bitfield caption="Data Present Select bit" mask="0x00200000" name="DPSEL" values="SDHCMODE__DPSEL" />
            <bitfield caption="Command Type bits" mask="0x00C00000" name="CTYPE" values="SDHCMODE__CTYPE" />
            <bitfield mask="0x3F000000" name="CIDX" />
         </register>
         <register caption="SDHC Response Register" name="SDHCRESP0" offset="0xc" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="RESP" />
         </register>
         <register caption="SDHC Response Register" name="SDHCRESP1" offset="0x10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="RESP" />
         </register>
         <register caption="SDHC Response Register" name="SDHCRESP2" offset="0x14" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="RESP" />
         </register>
         <register caption="SDHC Response Register" name="SDHCRESP3" offset="0x18" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="RESP" />
         </register>
         <register caption="SDHC Data Register" name="SDHCDATA" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="SDHC Status Register 1" name="SDHCSTAT1" offset="0x20" rw="R" size="4">
            <bitfield caption="Command Inhibit bit (CMD) bit" mask="0x00000001" name="CINHCMD" values="SDHCSTAT1__CINHCMD" />
            <bitfield caption="Command Inhibit bit (DAT) bit" mask="0x00000002" name="CINHDAT" values="SDHCSTAT1__CINHDAT" />
            <bitfield caption="DAT Line Active bit" mask="0x00000004" name="DLACTIVE" values="SDHCSTAT1__DLACTIVE" />
            <bitfield caption="Write Transfer Active bit" mask="0x00000100" name="WRACTIVE" values="SDHCSTAT1__WRACTIVE" />
            <bitfield caption="Read Transfer Active bit" mask="0x00000200" name="RDACTIVE" values="SDHCSTAT1__RDACTIVE" />
            <bitfield caption="Buffer Write Enable bit" mask="0x00000400" name="BWEN" values="SDHCSTAT1__BWEN" />
            <bitfield caption="Buffer Read Enable bit" mask="0x00000800" name="BREN" values="SDHCSTAT1__BREN" />
            <bitfield caption="Card Inserted bit" mask="0x00010000" name="CARDINS" values="SDHCSTAT1__CARDINS" />
            <bitfield caption="Card State Stable bit" mask="0x00020000" name="CARDST" values="SDHCSTAT1__CARDST" />
            <bitfield caption="Card Detect Signal Level bit" mask="0x00040000" name="CDSLVL" values="SDHCSTAT1__CDSLVL" />
            <bitfield caption="Write-protect Signal Level bit" mask="0x00080000" name="WPSLVL" values="SDHCSTAT1__WPSLVL" />
            <bitfield caption="DATA0 Signal Level bit" mask="0x00100000" name="DATA0SLVL" values="SDHCSTAT1__DATA0SLVL" />
            <bitfield caption="DATA1 Signal Level bit" mask="0x00200000" name="DATA1SLVL" values="SDHCSTAT1__DATA1SLVL" />
            <bitfield caption="DATA2 Signal Level bit" mask="0x00400000" name="DATA2SLVL" values="SDHCSTAT1__DATA2SLVL" />
            <bitfield caption="DATA3 Signal Level bit" mask="0x00800000" name="DATA3SLVL" values="SDHCSTAT1__DATA3SLVL" />
            <bitfield caption="Command Line Signal Level bit" mask="0x01000000" name="CMDSLVL" values="SDHCSTAT1__CMDSLVL" />
         </register>
         <register caption="SDHC Control Register 1" name="SDHCCON1" offset="0x24" rw="RW" size="4">
            <bitfield caption="Data Transfer Width bit" mask="0x00000002" name="DTXWIDTH" values="SDHCCON1__DTXWIDTH" />
            <bitfield caption="High-Speed Enable bit" mask="0x00000004" name="HSEN" values="SDHCCON1__HSEN" />
            <bitfield caption="DMA Select bits" mask="0x00000018" name="DMASEL" values="SDHCCON1__DMASEL" />
            <bitfield caption="Card Detect Test Level bit" mask="0x00000040" name="CDTLVL" values="SDHCCON1__CDTLVL" />
            <bitfield caption="Card Detect Signal Selection bit" mask="0x00000080" name="CDSSEL" values="SDHCCON1__CDSSEL" />
            <bitfield caption="SD Bus Power bit" mask="0x00000100" name="SDBP" values="SDHCCON1__SDBP" />
            <bitfield caption="Stop at Block Gap Request bit" mask="0x00010000" name="SBGREQ" values="SDHCCON1__SBGREQ" />
            <bitfield caption="Continue Request bit" mask="0x00020000" name="CONTREQ" values="SDHCCON1__CONTREQ" />
            <bitfield caption="Read Wait Control bit" mask="0x00040000" name="RDWTCON" values="SDHCCON1__RDWTCON" />
            <bitfield caption="Interrupt at Block Gap bit" mask="0x00080000" name="INTBG" values="SDHCCON1__INTBG" />
            <bitfield caption="Wake-up Event Enable on SD Card Interrupt bit" mask="0x01000000" name="WKONINT" values="SDHCCON1__WKONINT" />
            <bitfield caption="Wake-up Event Enable on SD Card Insertion bit" mask="0x02000000" name="WKONINS" values="SDHCCON1__WKONINS" />
            <bitfield caption="Wake-up Event Enable on SD Card Removal bit" mask="0x04000000" name="WKONREM" values="SDHCCON1__WKONREM" />
         </register>
         <register caption="SDHC Control Register 2" name="SDHCCON2" offset="0x28" rw="RW" size="4">
            <bitfield caption="Internal Clock Enable bit" mask="0x00000001" name="ICLKEN" values="SDHCCON2__ICLKEN" />
            <bitfield caption="Internal Clock Stable bit" mask="0x00000002" name="ICLKSTABLE" values="SDHCCON2__ICLKSTABLE" />
            <bitfield caption="SD Clock Enable bit" mask="0x00000004" name="SDCLKEN" values="SDHCCON2__SDCLKEN" />
            <bitfield mask="0x0000FF00" name="SDCLKDIV" />
            <bitfield caption="Data Time-out Counter Value bits" mask="0x000F0000" name="DTOC" values="SDHCCON2__DTOC" />
            <bitfield caption="Software Reset for All bit" mask="0x01000000" name="SWRALL" values="SDHCCON2__SWRALL" />
            <bitfield caption="Software Reset for CMD Line bit" mask="0x02000000" name="SWRCMD" values="SDHCCON2__SWRCMD" />
            <bitfield caption="Software Reset for DATA Line bit" mask="0x04000000" name="SWRDATA" values="SDHCCON2__SWRDATA" />
         </register>
         <register caption="SDHC Interrupt Status Register" name="SDHCINTSTAT" offset="0x2c" rw="R" size="4">
            <bitfield mask="0x00000001" name="CCIF" />
            <bitfield mask="0x00000002" name="TXCIF" />
            <bitfield caption="Block Gap Interrupt Flag bit" mask="0x00000004" name="BGIF" values="SDHCINTSTAT__BGIF" />
            <bitfield caption="DMA Interrupt Status bit" mask="0x00000008" name="DMAIF" values="SDHCINTSTAT__DMAIF" />
            <bitfield caption="Buffer Write Ready Interrupt Flag bit" mask="0x00000010" name="BWRDYIF" values="SDHCINTSTAT__BWRDYIF" />
            <bitfield caption="Buffer Read Ready Interrupt Flag bit" mask="0x00000020" name="BRRDYIF" values="SDHCINTSTAT__BRRDYIF" />
            <bitfield caption="Card Insertion Interrupt Flag bit" mask="0x00000040" name="CARDIIF" values="SDHCINTSTAT__CARDIIF" />
            <bitfield caption="Card Removal Interrupt Flag bit" mask="0x00000080" name="CARDRIF" values="SDHCINTSTAT__CARDRIF" />
            <bitfield caption="Card Interrupt Status bit" mask="0x00000100" name="CARDIF" values="SDHCINTSTAT__CARDIF" />
            <bitfield caption="Error Interrupt Flag bit" mask="0x00008000" name="EIF" values="SDHCINTSTAT__EIF" />
            <bitfield caption="Command Time-out Error Interrupt Flag bit" mask="0x00010000" name="CTOEIF" values="SDHCINTSTAT__CTOEIF" />
            <bitfield caption="Command CRC Error Interrupt Flag bit" mask="0x00020000" name="CCRCEIF" values="SDHCINTSTAT__CCRCEIF" />
            <bitfield caption="Command End Bit Error Interrupt Flag bit" mask="0x00040000" name="CEBEIF" values="SDHCINTSTAT__CEBEIF" />
            <bitfield caption="Command Index Error Interrupt Flag bit" mask="0x00080000" name="CIDXEIF" values="SDHCINTSTAT__CIDXEIF" />
            <bitfield caption="Data Time-out Error Interrupt Flag bit" mask="0x00100000" name="DTOEIF" values="SDHCINTSTAT__DTOEIF" />
            <bitfield caption="Data CRC Error Interrupt Flag bit" mask="0x00200000" name="DCRCEIF" values="SDHCINTSTAT__DCRCEIF" />
            <bitfield caption="Data End Bit Error Interrupt Flag bit" mask="0x00400000" name="DEBEIF" values="SDHCINTSTAT__DEBEIF" />
            <bitfield caption="Current-Limit Error Interrupt Flag bit" mask="0x00800000" name="CLEIF" values="SDHCINTSTAT__CLEIF" />
            <bitfield caption="Auto CMD12 Error Interrupt Flag bit" mask="0x01000000" name="ACEIF" values="SDHCINTSTAT__ACEIF" />
            <bitfield caption="ADMA Error Interrupt Flag bit" mask="0x02000000" name="ADEIF" values="SDHCINTSTAT__ADEIF" />
         </register>
         <register caption="SDHC Interrupt Flag Enable Register" name="SDHCINTEN" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CCIE" />
            <bitfield mask="0x00000002" name="TXCIE" />
            <bitfield caption="Block Gap Interrupt Flag Enable bit" mask="0x00000004" name="BGIE" values="SDHCINTEN__BGIE" />
            <bitfield caption="DMA Interrupt Flag Enable bit" mask="0x00000008" name="DMAIE" values="SDHCINTEN__DMAIE" />
            <bitfield caption="Buffer Write Ready Interrupt Flag Enable bit" mask="0x00000010" name="BWRDYIE" values="SDHCINTEN__BWRDYIE" />
            <bitfield caption="Buffer Read Ready Interrupt Flag Enable bit" mask="0x00000020" name="BRRDYIE" values="SDHCINTEN__BRRDYIE" />
            <bitfield caption="Card Insertion Interrupt Flag Enable bit" mask="0x00000040" name="CARDIIE" values="SDHCINTEN__CARDIIE" />
            <bitfield caption="Card Removal Interrupt Flag Enable bit" mask="0x00000080" name="CARDRIE" values="SDHCINTEN__CARDRIE" />
            <bitfield caption="Card Interrupt Flag Enable bit" mask="0x00000100" name="CARDIE" values="SDHCINTEN__CARDIE" />
            <bitfield mask="0x00008000" name="EIE" />
            <bitfield mask="0x00010000" name="CTOEIE" />
            <bitfield mask="0x00020000" name="CCRCEIE" />
            <bitfield mask="0x00040000" name="CEBEIE" />
            <bitfield mask="0x00080000" name="CIDXEIE" />
            <bitfield mask="0x00100000" name="DTOEIE" />
            <bitfield mask="0x00200000" name="DCRCEIE" />
            <bitfield mask="0x00400000" name="DEBEIE" />
            <bitfield mask="0x00800000" name="CLEIE" />
            <bitfield mask="0x01000000" name="ACEIE" />
            <bitfield mask="0x02000000" name="ADEIE" />
         </register>
