Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ2064DAL176.atdf
      <value-group caption="SQID2 Status bit" name="SQI1STAT2__SQID2">
         <value caption="Data is present on SQID2" name="" value="0x1" />
         <value caption="Data is not present on SQID2" name="" value="0x0" />
      </value-group>
      <value-group caption="SQID3 Status bit" name="SQI1STAT2__SQID3">
         <value caption="Data is present on SQID3" name="" value="0x1" />
         <value caption="Data is not present on SQID3" name="" value="0x0" />
      </value-group>
      <value-group caption="Control IFO Space Available bits" name="SQI1STAT2__CONAVAIL">
         <value caption="32 bytes are available" name="" value="0x1f" />
         <value caption="31 bytes are available" name="" value="0x1e" />
         <value caption="1 byte is available" name="" value="0x1" />
         <value caption="No bytes are available" name="" value="0x0" />
      </value-group>
      <value-group caption="Current Command Status bits" name="SQI1STAT2__CMDSTAT">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Receive" name="" value="0x2" />
         <value caption="Transmit" name="" value="0x1" />
         <value caption="Idle" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Enable bit" name="SQI1BDCON__DMAEN">
         <value caption="DMA is enabled" name="" value="0x1" />
         <value caption="DMA is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Descriptor Poll Enable bit" name="SQI1BDCON__POLLEN">
         <value caption="BDP poll enabled" name="" value="0x1" />
         <value caption="BDP poll is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Descriptor Processor Start bit" name="SQI1BDCON__START">
         <value caption="Start the buffer descriptor processor" name="" value="0x1" />
         <value caption="Disable the buffer descriptor processor" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Buffer Descriptor Processor Active Status bit" name="SQI1BDSTAT__DMAACTV">
         <value caption="Buffer Descriptor Processor is active" name="" value="0x1" />
         <value caption="Buffer Descriptor Processor is idle" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Buffer Descriptor Processor Start Status bit" name="SQI1BDSTAT__DMASTART">
         <value caption="DMA has started" name="" value="0x1" />
         <value caption="DMA has not started" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Buffer Descriptor Processor State Status bits" name="SQI1BDSTAT__BDSTATE">
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Fetched buffer descriptor is disabled" name="" value="0x5" />
         <value caption="Descriptor is done" name="" value="0x4" />
         <value caption="Data phase" name="" value="0x3" />
         <value caption="Buffer descriptor is loading" name="" value="0x2" />
         <value caption="Descriptor fetch request is pending" name="" value="0x1" />
         <value caption="Idle" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Empty Interrupt Signal Enable bit" name="SQI1INTSIGEN__TXEMPTYISE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Full Interrupt Signal Enable bit" name="SQI1INTSIGEN__TXFULLISE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Threshold Interrupt Signal Enable bit" name="SQI1INTSIGEN__TXTHRISE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Empty Interrupt Signal Enable bit" name="SQI1INTSIGEN__RXEMPTYISE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Full Interrupt Signal Enable bit" name="SQI1INTSIGEN__RXFULLISE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Threshold Interrupt Signal Enable bit" name="SQI1INTSIGEN__RXTHRISE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Control Buffer Full Interrupt Signal Enable bit" name="SQI1INTSIGEN__CONFULLISE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Control Buffer Empty Interrupt Signal Enable bit" name="SQI1INTSIGEN__CONEMPTYISE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Control Buffer Threshold Interrupt Signal Enable bit" name="SQI1INTSIGEN__CONTHRISE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Buffer Descriptor Done Interrupt Signal Enable bit" name="SQI1INTSIGEN__BDDONEISE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
